# DATA ANALYTICS DS165L Laboratory Exercise #2

### Alliyah Rhayven A. Leviste | AM14 |

In [2]:
import pandas as pd
import numpy as np

## Question 1

Create the following data frame using suitable commands such as np.arange, list etc

In [45]:

df = pd.DataFrame({
    "column_a": np.array(["a", "b", "c", "d"]),
    "column_b": np.array(["20", "21", "22", "23"]),
    "column_c": np.array(["31", "32", "33", "34"]),
    "column_d": np.array(["41", "42", "43", "44"]),
    "column_e": np.array(["5.1", "5.2", "5.3", "5.4"]),
    "column_f": np.array(["aa", "bb", "cc", "dd"]),
    "column_g": np.array(["2002-02-23 00:00:00.00000002", "2003-09-01 00:00:00.00000001", "2024-01-05 00:00:00.00000001", "2024-08-31 00:00:00.00000008"]),
    "column_h": np.array(["2002-02-23 00:00:00.00000023", "2003-09-01 00:00:00.00000009", "2024-01-05 00:00:00.00000005", "2024-08-31 00:00:00.00000031"]),
    "column_i": np.array(["True", "True", "True", "True"])
})

df

,column_a,column_b,column_c,column_d,column_e,column_f,column_g,column_h,column_i
0,a,20,31,41,5.1,aa,2002-02-23 00:00:00.00000002,2002-02-23 00:00:00.00000023,True
1,b,21,32,42,5.2,bb,2003-09-01 00:00:00.00000001,2003-09-01 00:00:00.00000009,True
2,c,22,33,43,5.3,cc,2024-01-05 00:00:00.00000001,2024-01-05 00:00:00.00000005,True
3,d,23,34,44,5.4,dd,2024-08-31 00:00:00.00000008,2024-08-31 00:00:00.00000031,True

## Question 2
Data for this question can be found from "tweets" sheet in assignment-data.xlsx. “ABC Company” has collected “tweets” from tweet.com and instructed its junior data scientist “Mr. Jo Jo” to mask sensitive data so that they can use the masked data for testing.

#### Task 1

Mr.Jo Jo likes to do his experiment on small amount of data thus decided to play with only 10 rows. Read only the rows 3-12 from tweets sheet and name it as "df" and display the type of df. The output should be shown as follows:

In [3]:
df = pd.read_excel(r'C:\Users\Rhayven\Downloads\assignment-data.xlsx',
     sheet_name='tweets',
     skiprows=2,
     nrows=11,
     header=0)

In [7]:
df.columns = ['tweet id', 'created_at', 'tweet', 'retweet', 'username']
print(type(df))

<class 'pandas.core.frame.DataFrame'>

In [8]:
df

,tweet id,created_at,tweet,retweet,username
0,832516558903730176,2017-02-17 09:06:29,@comark yes check the flux capacitor in our lo...,0,88mph_Africa
1,832293187670704128,2017-02-16 18:18:53,RT @iafrikan: .@88mph_Africa stopped running i...,1,88mph_Africa
2,831880802489217024,2017-02-15 15:00:13,88mph invest in Ahoy - a business travel app f...,1,88mph_Africa
3,946063916068634631,2017-12-27 17:03:09,"Ce samedi 30 décembre 2017 à @ActivSpaces, se ...",4,ActiveSpaces
4,945973955847999488,2017-12-27 11:05:41,RT @OIFfrancophonie: Retour en vidéo sur la vi...,27,ActiveSpaces
5,945972004548726785,2017-12-27 10:57:55,RT @OIFfrancophonie: L’OIF a organisé un ateli...,13,ActiveSpaces
6,945606558930690048,2017-12-26 10:45:46,Plus que deux jours et les inscriptions seront...,5,ActiveSpaces
7,945595453256687616,2017-12-26 10:01:39,RT @nlend_nyounai: Transform your idea into a ...,1,ActiveSpaces
8,945595401729724416,2017-12-26 10:01:26,RT @ElongWilliam: Si tu as une idée et tu es u...,6,ActiveSpaces
9,944304498461347840,2017-12-22 20:31:51,RT @chantaledie: AWESOME https://t.co/pTu3k5LA81,2,ActiveSpaces
10,944257477062914048,2017-12-22 17:25:00,"A la SENUM 2017, Aurélie Adam Soulé Zoumarou p...",1,ActiveSpaces

#### Task 2

Mr.Jo Jo found that “tweetid, created-at and username” columns are sensitive thus decided to mask the values from those columns. He created new columns “newtweet-id”,”created-at4” to store the masked “tweet-ids” and masked “created-at” values. He decided to use “username” column to store masked usernames. Now, analyze the following output figure to do essential mask operations.

In [3]:
df9 = pd.read_excel(r'C:\Users\Rhayven\Downloads\assignment-data.xlsx',
     sheet_name='tweets')

df9.rename(columns={'tweet_id':'new_tweet_id'},inplace=True)

df9.rename(columns={'created_at':'created_at4'},inplace=True)

df9['username'] = 'yyy'

df9.iloc[0:10]

,new_tweet_id,created_at4,tweet,retweets,username
0,833615769179144194,2017-02-20 09:54:21,Real time not cached results . https://t.co/ju...,0,yyy
1,833615060425703424,2017-02-20 09:51:32,how last minute can you be when buying a fligh...,0,yyy
2,832516558903730176,2017-02-17 09:06:29,@comark yes check the flux capacitor in our lo...,0,yyy
3,832293187670704128,2017-02-16 18:18:53,RT @iafrikan: .@88mph_Africa stopped running i...,1,yyy
4,831880802489217024,2017-02-15 15:00:13,88mph invest in Ahoy - a business travel app f...,1,yyy
5,946063916068634631,2017-12-27 17:03:09,"Ce samedi 30 décembre 2017 à @ActivSpaces, se ...",4,yyy
6,945973955847999488,2017-12-27 11:05:41,RT @OIFfrancophonie: Retour en vidéo sur la vi...,27,yyy
7,945972004548726785,2017-12-27 10:57:55,RT @OIFfrancophonie: L’OIF a organisé un ateli...,13,yyy
8,945606558930690048,2017-12-26 10:45:46,Plus que deux jours et les inscriptions seront...,5,yyy
9,945595453256687616,2017-12-26 10:01:39,RT @nlend_nyounai: Transform your idea into a ...,1,yyy

## Question 3
Data for this question can be found in "online-retail" sheet from assignmentdata.xlsx. Since it is a big data, load first 200 rows and keep it in the data frame called "dataset". This “dataset” is used for all tasks in this question. 

Assume that you are a data scientist in Amazon. Since the company is celebrating Silver Jubilee this year, it has decided to reward their customers. Your Manager handed over last 2 years retail data and asked you to do certain tasks. The tasks are as follows:

#### Task 1

When you started working with data, you’ve realized that it needs cleaning to produce better results. Do essential data cleaning. The final output should be the one as follows:

In [60]:
df3 = pd.read_excel(r'C:\Users\Rhayven\Downloads\assignment-data.xlsx', 
                        sheet_name='online-retail', 
                        nrows=200)

In [62]:
numerical= df3.select_dtypes(include=['number'])

In [68]:
bcleaned = (numerical < 0).any().any()
print("BEFORE CLEANING: Any negatives?", bcleaned)

BEFORE CLEANING: Any negatives? True

In [65]:
df3_clean = df3[~(numerical < 0).any(axis=1)]

In [66]:
numerical_cc = df3_clean.select_dtypes(include=['number'])

In [67]:
aclean = (numerical_cc <0).any().any()
print("AFTER CLEANING: any negatives?", aclean)

AFTER CLEANING: any negatives? False

#### Task 2
Amazon wants to reward the customer who has done the most number of transactions, by providing a gift hamper worth 1000 pesos. Find out the customer who has done the most number of transactions [Note: One invoice number corresponds to one transaction]. The output should the one as below:

Hurray! The most number of transactions is done by Customer ID: __ . He has made __ transactions. He will be rewarded with our gift hamper worth 1000 Pesos.

In [77]:
df4 = pd.read_excel(r'C:\Users\Rhayven\Downloads\assignment-data.xlsx', 
                    sheet_name='online-retail', 
                    nrows=200)

transaction = df4.groupby('CustomerID')['InvoiceNo'].nunique()

In [72]:
most_transcust = transaction.idxmax()
most_transcount = transaction.max()

In [73]:
print(f"Hurray! The most number of transactions is done by Customer ID: {most_transcust}. He has made {most_transcount} transactions. He will be rewarded with our gift hamper worth 1000 Pesos.")

Hurray! The most number of transactions is done by Customer ID: 17850. He has made 6 transactions. He will be rewarded with our gift hamper worth 1000 Pesos.

#### Task 3
Amazon wants to find the best customer and likes to reward 50% discount on his next purchase. Find the Customer with the highest amount of total purchase amount. The output should the one as below:

Customer ID: ___ is the best customer since he has spent a lot on our business. His total purchase amount is 3702.12 pesos. 50% discount will be given on his next purchase.

In [120]:
df5 = pd.read_excel(r'C:\Users\Rhayven\Downloads\assignment-data.xlsx', 
                   sheet_name='online-retail', 
                   nrows=200)

In [24]:
print(df5.columns)

Index(['InvoiceNo', 'StockCode', 'Description', 'Quantity', 'InvoiceDate',
       'UnitPrice', 'CustomerID', 'Country'],
      dtype='object')

In [25]:
df5['TotalAmount'] = df5['Quantity'] * df5['UnitPrice']

custotals=df5.groupby('CustomerID')['TotalAmount'].sum()

print(type(custotals))

<class 'pandas.core.series.Series'>

In [27]:
bestcustid = custotals.idxmax()
bestcustotals = custotals.max()

out = ("Customer ID: {bestcustid} is the best customer since he has spent a lot on our business. "
          f"His total purchase amount is {bestcustotals:.2f} pesos. "
          "50% discount will be given on his next purchase.")

print(out)

Customer ID: {bestcustid} is the best customer since he has spent a lot on our business. His total purchase amount is 3702.12 pesos. 50% discount will be given on his next purchase.

#### Task 4
Amazon wants to find out the most and the least bought items. It likes to increase the sale of least bought item by bundling it with the most bought item and ready to give special 10% discount for this bundle. The output should be the one as below.

Most bought item is StockCode __ with __ purchased quantity
Least bought item is StockCode __ with __ in purchased quantity.
These two items can be bundled and provide 10% discount on this bundle to increase the count of StockCode __.

In [38]:
df6 = pd.read_excel(r'C:\Users\Rhayven\Downloads\assignment-data.xlsx', 
                    sheet_name='online-retail', 
                    nrows=200)

In [39]:
print(df6.dtypes)

InvoiceNo              object
StockCode              object
Description            object
Quantity                int64
InvoiceDate    datetime64[ns]
UnitPrice             float64
CustomerID              int64
Country                object
dtype: object

In [44]:
df6['Quantity'] = pd.to_numeric(df6['Quantity'], errors='coerce')
df6 = df6[df6['Quantity'] >= 0]

In [46]:
totalitems = df6.groupby('StockCode')['Quantity'].sum()

mostitems = totalitems.idxmax()
mostquantity = totalitems.max()

leastitems = totalitems.idxmin()
leastquantity = totalitems.min()

print("Most Bought Item:", mostitems)
print("Most Bought Quantity:", mostquantity)
print("Least Bought Item:", leastitems)
print("Least Bought Quantity:", leastquantity)

Most Bought Item: 21731
Most Bought Quantity: 458
Least Bought Item: 21166
Least Bought Quantity: 1

In [47]:
out = (f"Most bought item is StockCode {mostitems} with {mostquantity} purchased quantity. "
          f"Least bought item is StockCode {leastitems} with {leastquantity} in purchased quantity. "
          f"These two items can be bundled and provide 10% discount on this bundle to increase the count of StockCode {leastitems}.")

print(out)

Most bought item is StockCode 21731 with 458 purchased quantity. Least bought item is StockCode 21166 with 1 in purchased quantity. These two items can be bundled and provide 10% discount on this bundle to increase the count of StockCode 21166.

#### Task 5
Company likes to find out overall average purchase-amount among all transactions
[ one transaction indicates one invoice number]. The expected output is as follows:

Average purchase amount among all transactions = __

In [109]:
df8 = pd.read_excel(r'C:\Users\Rhayven\Downloads\assignment-data.xlsx', 
                    sheet_name='online-retail', 
                    nrows=200)

In [119]:
totaltransaction = df8['TotalPurchaseAmount'].sum()
averageamount = df8['TotalPurchaseAmount'].mean()

print(f"Average purchase amount among all transactions = {averageamount:.2f}")

Average purchase amount among all transactions = 44.07

#### Task 6

Company also likes to find out the total purchase amount and the number of transactions made by each customer in their lifetime. Create new data frame called "new-dataset", containing the columns ['CustomerID', 'TotalPurchaseAmount', 'NumberofTransactions']. Display the last 10 rows. 
Expected output is as follows:

In [56]:
df7 = pd.read_excel(r'C:\Users\Rhayven\Downloads\assignment-data.xlsx', 
                   sheet_name='online-retail', 
                   nrows=200)

In [75]:
new_dataset = df.groupby('CustomerID').agg(
    Total_Purchase_Amount=('TotalPurchaseAmount', 'sum'),
    Number_of_Transactions=('InvoiceNo', 'count')
).reset_index()

In [76]:
new_dataset.tail(10)

    CustomerID  Total_Purchase_Amount  Number_of_Transactions
6        15100                 350.40                       1
7        15291                 328.80                       2
8        15311                 445.33                      36
9        16029                3702.12                       8
10       16098                 430.60                      12
11       16250                 226.14                      14
12       17420                 130.85                       7
13       17809                  34.80                       1
14       17850                 725.44                      45
15       18074                 489.60                      13

#### Task 7
Company also likes to know average purchase amount made by every customer to 
get an idea of how much they’ve spent with their business in average. Append a column "AveragePurchase" in the new-dataset. Get the average total  purchase per CustomerID. Display first 5 results. Expected output is as follows.

In [103]:
new_dataset['AveragePurchase'] = new_dataset['Total_Purchase_Amount'] / new_dataset['Number_of_Transactions']

In [80]:
(new_dataset.head(5))

   CustomerID  Total_Purchase_Amount  Number_of_Transactions  AveragePurchase
0       12431                 105.60                       3        35.200000
1       12583                 855.86                      20        42.793000
2       13047                 366.63                      17        21.566471
3       13748                 204.00                       1       204.000000
4       14527                 -27.50                       1       -27.500000